@extends('layouts.app')
@section('menu')
    @parent
@endsection

@section('content')

    <div class="container">
        <div class="row" style="margin-bottom: 140px;">
            <div class="col-lg-7 col-md-12 col-sm-12">
                <canvas width="566" height="700" id="game"></canvas>
            </div>
                
            {{-- Скрипт игры --}}
            <script type="text/javascript" src="{{asset('assets/js/arcanoid.js')}}"></script>
            <div class="col-lg-5 col-md-12 col-sm-12">
                <h3>Правила игры</h3>
            <p>
                Цель игры - цель игры — сбить все кирпичи и не дать шарику упасть. Чтобы начать игру, нажмите <b>"S"</b>.
            </p>
            <p> Суть игры:</p>
            <p> сверху игрового поля стоят несколько рядов кирпичей; </p>
            <p> по полю движется шарик, который при касании убирает кирпич и отскакивает в противоположную сторону; </p>
            <p> от стен и верха шарик тоже отскакивает; </p>
            <p> внизу есть подвижная платформа, как ракетка. Платформа управляется стрелками влево и вправо;</p>
            <p> чтобы шарик не упал вниз, игрок двигает платформу влево или вправо, подставляя её под шарик;</p>
            <p> если шарик падает мимо платформы — игра останавливается или заканчивается совсем; </p>
            <p>за каждые 25 набранных очков увеличивается платформа на 2 пикселя, чтобы игроку было проще играть дальше;</p>
            <p>за каждые 100 очков выдаём дополнительную жизнь;</p>
            <p>одновременно с увеличением жизни будем ускорять шарик — чтобы было сложнее играть;</p>
            <p>за каждое падение шарика жизнь отнимается;</p>
            </div>
    
        </div>
        <div class="m-bottom-5" style="height: 10px"></div>
    </div> 

@endsection